src/cf/InformationRegisters/НаименованияЗадачУчастниковДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НаименованияЗадачУчастниковДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НаименованиеЭтапа</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковИсполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковИсполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезолюцию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоопределениеФункцииУчастника</Name>
					<Comment>Автоопределение функции участника (рассмотрение/исполнение)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковОзнакомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковОзнакомления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ознакомляемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомляющий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подписывающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийОбработкуРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийЗавершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковУтверждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковУтверждения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НаименованияЗадачУчастниковДействий/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидДействия") 
		И ЗначениеЗаполнено(Параметры.ВидДействия) Тогда
		Запись.ВидДействия = Параметры.ВидДействия;
	КонецЕсли;
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьНаименованияОписания();

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.Наименование) 
		И Не ЗначениеЗаполнено(Запись.ШаблонНаименования)
		И Не ЗначениеЗаполнено(Запись.Описание) 
		И Не ЗначениеЗаполнено(Запись.ШаблонОписания) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Введите какое-либо значение наименования, например ""Наименование"" или ""Описание""'"),,
			"Запись.Наименование",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если Не Элементы.Этап.Доступность И ЗначениеЗаполнено(ТекущийОбъект.Этап) Тогда
		
		ТекущийОбъект.Этап = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДействияПриИзменении(Элемент)
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура ФункцияПриИзменении(Элемент)
	
	УправлениеЭлементами();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Запись.Наименование = СокрЛП(Запись.Наименование);
	Есть = Ложь;
	Если Найти(Запись.Наименование, """") > 0 Тогда
		Запись.Наименование = СтрЗаменить(Запись.Наименование, """", "");
		Есть = Истина;
	КонецЕсли;
	Если Найти(Запись.Наименование, ":") > 0 Тогда
		Запись.Наименование = СтрЗаменить(Запись.Наименование, ":", "");
		Есть = Истина;
	КонецЕсли;
	Если Есть Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Запрещается использовать символы "":'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		МассивЭтапов = Новый Массив;
		
		Если ТипЗнч(Запись.Функция) = Тип("ПеречислениеСсылка.ФункцииУчастниковПодписания") Тогда 
			ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Подписание");
		ИначеЕсли ТипЗнч(Запись.Функция) = Тип("ПеречислениеСсылка.ФункцииУчастниковСогласования") Тогда 
			ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Согласование");
		Иначе 
			Возврат;
		КонецЕсли;
		
		ДанныеВыбора = РаботаСЭтапамиВызовСервера.ДанныеВыбора(Текст, 
			ТипДействия,
			МассивЭтапов);
			
		Если ДанныеВыбора.Количество() <> 0 Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаголовкаПриИзменении(Элемент)
	
	УстановитьДоступностьНаименованияОписания();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОписанияПриИзменении(Элемент)
	
	УстановитьДоступностьНаименованияОписания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	Если ЗначениеЗаполнено(Запись.ВидДействия) Тогда
		
		ТипДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ВидДействия, "Тип");
		Элементы.Функция.СписокВыбора.очистить();
		
		Если ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Исполнение") Тогда
			ТипФункции = Новый ОписаниеТипов("ПеречислениеСсылка.ФункцииУчастниковИсполнения");
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковИсполнения.Исполнитель);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковИсполнения.Рассматривающий);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезолюцию);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковИсполнения.ОбрабатывающийРезультат);
			
		ИначеЕсли ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Ознакомление") Тогда
			ТипФункции = Новый ОписаниеТипов("ПеречислениеСсылка.ФункцииУчастниковОзнакомления");
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковОзнакомления.Ознакомляемый);
			Запись.Функция = Перечисления.ФункцииУчастниковОзнакомления.Ознакомляемый;
			
		ИначеЕсли ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Подписание") Тогда
			ТипФункции = Новый ОписаниеТипов("ПеречислениеСсылка.ФункцииУчастниковПодписания");
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковПодписания.Подписывающий);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковПодписания.ОбеспечивающийПодписание);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковПодписания.ОбрабатывающийРезультат);
						
		ИначеЕсли ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Регистрация") Тогда
			ТипФункции = Новый ОписаниеТипов("ПеречислениеСсылка.ФункцииУчастниковРегистрации");
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковРегистрации.Регистратор);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковРегистрации.ОбрабатывающийРезультат);
			
		ИначеЕсли ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Согласование") Тогда
			ТипФункции = Новый ОписаниеТипов("ПеречислениеСсылка.ФункцииУчастниковСогласования");
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковСогласования.Согласующий);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковСогласования.ОбрабатывающийРезультат);
			
		ИначеЕсли ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Утверждение") Тогда
			ТипФункции = Новый ОписаниеТипов("ПеречислениеСсылка.ФункцииУчастниковУтверждения");
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковУтверждения.Утверждающий);
			Элементы.Функция.СписокВыбора.Добавить(Перечисления.ФункцииУчастниковУтверждения.ОбрабатывающийРезультат);
			
		Иначе
			Возврат;
			
		КонецЕсли;
				
		Запись.Функция = ТипФункции.ПривестиЗначение(Запись.Функция);		
		ЭтапыДоступны = ДействияКлиентСервер.ЭтоДействиеСЭтапами(ТипДействия)
			И Не ДействияКлиентСервер.ЭтоФункцияОбработатьРезультат(Запись.Функция);
		Элементы.Этап.Доступность = ЭтапыДоступны;
		Если Не ЭтапыДоступны И ЗначениеЗаполнено(Запись.Этап) Тогда
			Запись.Этап = Неопределено;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьНаименованияОписания()
	
	Элементы.Наименование.Доступность = Не ЗначениеЗаполнено(Запись.ШаблонНаименования);
	Элементы.Описание.Доступность = Не ЗначениеЗаполнено(Запись.ШаблонОписания);
	
КонецПроцедуры

#КонецОбласти
